acpi
amd-ucode
base
base-devel
bat
bat-extras
blueman
bluez
bluez-utils
breeze
brightnessctl
btop
calcurse
celluloid
cliphist
dkms
dolphin
efibootmgr
emacs
fastfetch
fd
firefox
gammastep
gcc-fortran
geoclue
git
gnome-keyring
grim
gst-plugin-pipewire
htop
hypridle
hyprland
hyprlock
hyprpicker
hyprshot
iwd
jdk25-openjdk
kitty
kvantum
kvantum-qt5
lazygit
less
libpulse
libreoffice-still-pt
libva-nvidia-driver
linux
linux-firmware
linux-headers
man-db
maven
mpv-mpris
nano
neovim
network-manager-applet
networkmanager
noto-fonts-cjk
npm
nvidia-open-dkms
nwg-look
opam
otf-font-awesome
pamixer
papirus-icon-theme
pavucontrol
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
polkit-kde-agent
power-profiles-daemon
python-pip
qalculate-gtk
qt5-graphicaleffects
qt5-svg
qt5-wayland
qt5ct
qt6-wayland
qt6ct
reflector
rofi
rust-analyzer
rustup
sddm
seahorse
slurp
smartmontools
sof-firmware
starship
steam
sudo
swaync
tree
ttf-droid
ttf-jetbrains-mono-nerd
ttf-space-mono-nerd
typst
uwsm
vim
vlc
wasi-compiler-rt
wasi-libc
wget
wireless_tools
wireplumber
wl-clipboard
woff2-font-awesome
wofi
wpa_supplicant
wtype
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-utils
xorg-server
xorg-xinit
yazi
zathura
zathura-pdf-mupdf
zram-generator
zsh
zsh-autosuggestions
zsh-syntax-highlighting
